pruebas-artillery/cp-pe-02.yml
config:
  target: "https://vetconnect-q6c5.onrender.com"
  phases:
    - duration: 60
      arrivalRate: 5
  plugins:
    expect: {}
    ensure:
      conditions:
        - expression: "http.response_time.p95 <= 1000"
        - expression: "vusers.failed == 0"

scenarios:
  - name: CP-PE-02 Catálogo
    flow:
      - get:
          url: "/negocios/catalogo?pagina=1&limite=20"
          expect:
            - statusCode: 200
            - contentType: json